#!/bin/bash
echo "1" > /proc/sys/net/ipv4/ip_forward   #（开启路由功能）
ipvsadm -C      #（清除之前的转换表）
ipvsadm -At 192.168.2.220:2000 -s rr   #（指定带有调度算法转换的服务器）
ipvsadm -at 192.168.2.220:2000 -r 192.168.2.36:8080 -m  #（增加一台真实服务器，-m是nat模式，-g是直接路由（dr )模式，-i是tun模式）
ipvsadm -at 192.168.2.220:2000 -r 192.168.2.36:8081 -m
ipvsadm -at 192.168.2.220:2000 -r 192.168.2.36:8082 -m
ipvsadm -at 192.168.2.220:2000 -r 192.168.2.36:8083 -m
ipvsadm -at 192.168.2.220:2000 -r 192.168.2.67:8080 -m
ipvsadm -at 192.168.2.220:2000 -r 192.168.2.67:8081 -m
